# a = 5
# b =7
# c =3

# print(a + b + c)
# print(a * b * c)
# print((a + b + c) // 3)

# Переверните число
num = 4321
print(num)
res = num % 10 *1000
print(res)
num //= 10
res += num % 10 *100
print(res)
num //= 10
res += num % 10 *10
print(res)
num //= 10
res += num % 10
print(res)


# name = input("Введите имя: ")
# print("Ваше имя:", name)


# num = int(input("Введите число: "))
# power = int(input("Введите степень возведения: "))

# res = num ** power
# print("число:", num, "в степени:", power, "равно:", res)


# Задача
"""
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
num3 = int(input("Введите третье число: "))
num4 = int(input("Введите четвертое число: "))

sum1 = num1 + num2
sum2 = num3 + num4

res = round((sum1 / sum2), 2)

print(res)

"""







